---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.DataDictionaryDifferentInLink
source: html/3f6c39b5-2ca1-75be-6b03-0ab8d1a56e2e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.DataDictionaryDifferentInLink Property

Linked file [Name] was last saved in a previous version of Revit. Changes to it cannot be saved until it is upgraded.

## Syntax (C#)
```csharp
public static FailureDefinitionId DataDictionaryDifferentInLink { get; }
```